# Pandas
- provides high-performance, easy to use data structures and data analysis tools for Python

In [1]:
# Importing Pandas

import pandas as pd
import numpy as np

In [2]:
# Playing with Dataframes

df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1', 'Row2', 'Row3', 'Row4', 'Row5'], columns=['Column1', 'Column2', 'Column3', 'Column4'])

df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [3]:
df.to_csv('test1.csv')

# csv file gets created

### Accessing the elements
- .loc (uses label based indexing)   
- .iloc (uses integer based indexing)
- directly from column name

In [7]:
df.loc['Row1']

# retrieves the 1st row

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int64

In [12]:
df.iloc[0]

# retrieves the 1st row

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int64

In [13]:
df.iloc[:,:]

# retrieves all the columns and rows

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [22]:
df['Column1']

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: Column1, dtype: int64

In [25]:
type(df['Column1'])

# a series

pandas.core.series.Series

In [24]:
df[['Column1','Column2']]

      Column1  Column2
Row1        0        1
Row2        4        5
Row3        8        9
Row4       12       13
Row5       16       17

In [26]:
type(df[['Column1','Column2']])

# a dataframe

pandas.core.frame.DataFrame

In [14]:
type(df.loc['Row1'])

# a series (a column or a row)

pandas.core.series.Series

In [15]:
type(df.iloc[:,:])

# a dataframe (at least 2 columns or rows)

pandas.core.frame.DataFrame

In [16]:
df.iloc[:,:].values

# converts the dataframe into an array

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [17]:
df.iloc[:,:].values.shape

(5, 4)

### Checking for Null values

In [18]:
df.isnull().sum()

# gives the total count of null values in each column

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [20]:
df['Column1'].value_counts()

# gives the total count of each unique value in a column

0     1
4     1
8     1
12    1
16    1
Name: Column1, dtype: int64

In [21]:
df['Column1'].unique()

# gives an array of *only* unique values in a column

array([ 0,  4,  8, 12, 16])